src/cfd/templates/simple/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     simpleFoam;
startFrom       startTime;  startTime 0;
stopAt          endTime;    endTime   600;
deltaT          1;
writeControl    timeStep;   writeInterval 200;  purgeWrite 2;
writeFormat     ascii;      timePrecision 6;
functions
{
    forces
    {
        type            forces;
        libs            (forces);
        patches         (hull);
        rho             rhoInf;
        rhoInf          {{RHO}};
        CofR            (0 0 0);
        writeControl    timeStep;
        writeInterval   1;
    }
}
