src/cfd/templates/simple/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform {{K_INIT}};
boundaryField
{
    inlet    { type fixedValue; value uniform {{K_INIT}}; }
    outlet   { type inletOutlet; inletValue uniform {{K_INIT}}; value $internalField; }
    side     { type slip; }
    bottom   { type slip; }
    top      { type slip; }
    symmetry { type symmetryPlane; }
    hull     { type kqRWallFunction; value uniform {{K_INIT}}; }
}
