src/cfd/templates/simple/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions [0 0 -1 0 0 0 0];
internalField uniform {{OMEGA_INIT}};
boundaryField
{
    inlet    { type fixedValue; value uniform {{OMEGA_INIT}}; }
    outlet   { type inletOutlet; inletValue uniform {{OMEGA_INIT}}; value $internalField; }
    side     { type slip; }
    bottom   { type slip; }
    top      { type slip; }
    symmetry { type symmetryPlane; }
    hull     { type omegaWallFunction; value uniform {{OMEGA_INIT}}; }
}
