src/cfd/templates/simple/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p        { solver GAMG; smoother GaussSeidel; tolerance 1e-6; relTol 0.05; }
    "(U|k|omega)" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-7; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes;
    residualControl { p 1e-4; U 1e-5; "(k|omega)" 1e-5; }
}
relaxationFactors { equations { U 0.8; ".*" 0.6; } }
